#include "io.h"
#include "tasks.h"

int main(){
  tasks_handler();
  return 0;
}

/*
STL3Alg4 - удалить элементы между двумя отрицательными элементами, если элемент один, то всё после него
STL3Alg18 - дан дек, не менее 2N элементов, заполнить первые N: 1,2,3...N, а последние N: N,N-1,N-2...1
STL3Alg48 - дан вектор кол-вом элементов, которое делится на 3, вче трети отсортированны, нужно сгруппировать отрицательные < нули < положительные
STL3Alg60 - дан список, получить вектор со средними значениями пар из списка
*/